zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/MC56F83786/codewarrior/MC56F83786_Vectors.c
/* User could redefine ivINT_TRBUF.
Please be noted that ivINT_TRBUF can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_TRBUF definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_TRBUF(void);
__attribute__((weak)) void ivINT_TRBUF(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for TX_REG **********************/

/* User could redefine ivINT_TX_REG.
Please be noted that ivINT_TX_REG can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_TX_REG definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_TX_REG(void);
__attribute__((weak)) void ivINT_TX_REG(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for RX_REG **********************/

/* User could redefine ivINT_RX_REG.
Please be noted that ivINT_RX_REG can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_RX_REG definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_RX_REG(void);
__attribute__((weak)) void ivINT_RX_REG(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for BUS_ERR **********************/

/* User could redefine ivINT_BUS_ERR.
Please be noted that ivINT_BUS_ERR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_BUS_ERR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_BUS_ERR(void);
__attribute__((weak)) void ivINT_BUS_ERR(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for SWI2 **********************/

/* User could redefine ivINT_SWI2.
Please be noted that ivINT_SWI2 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_SWI2 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_SWI2(void);
__attribute__((weak)) void ivINT_SWI2(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for SWI1 **********************/

/* User could redefine ivINT_SWI1.
Please be noted that ivINT_SWI1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_SWI1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_SWI1(void);
__attribute__((weak)) void ivINT_SWI1(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for SWI0 **********************/

/* User could redefine ivINT_SWI0.
Please be noted that ivINT_SWI0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_SWI0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_SWI0(void);
__attribute__((weak)) void ivINT_SWI0(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for XBARA **********************/

/* User could redefine ivINT_XBARA.
Please be noted that ivINT_XBARA can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_XBARA definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_XBARA(void);
__attribute__((weak)) void ivINT_XBARA(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for LVI1 **********************/

/* User could redefine ivINT_LVI1.
Please be noted that ivINT_LVI1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_LVI1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_LVI1(void);
__attribute__((weak)) void ivINT_LVI1(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for OCCS **********************/

/* User could redefine ivINT_OCCS.
Please be noted that ivINT_OCCS can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_OCCS definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_OCCS(void);
__attribute__((weak)) void ivINT_OCCS(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for TMRB_3 **********************/

/* User could redefine ivINT_TMRB_3.
Please be noted that ivINT_TMRB_3 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_TMRB_3 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_TMRB_3(void);
__attribute__((weak)) void ivINT_TMRB_3(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for TMRB_2 **********************/

/* User could redefine ivINT_TMRB_2.
Please be noted that ivINT_TMRB_2 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_TMRB_2 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_TMRB_2(void);
__attribute__((weak)) void ivINT_TMRB_2(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for TMRB_1 **********************/

/* User could redefine ivINT_TMRB_1.
Please be noted that ivINT_TMRB_1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_TMRB_1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_TMRB_1(void);
__attribute__((weak)) void ivINT_TMRB_1(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

